# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

my_list = [7, 5, 3, 3, 2]

user_ans = ""
while user_ans != "exit":
    user_ans = input("insert number (for exit insert - exit): ")
    if user_ans == "exit":
        break

    num = int(user_ans)
    for indx, el in reversed(list(enumerate(my_list))):
        if num <= el:
            my_list.insert(indx + 1, num)
            break
    if num > my_list[0]:
        my_list.insert(0, num)

    print(my_list)



